{
  "title": "Działalność",
  "intro": "E-XPERT to społeczność, która nie tylko mówi o technologii również tworzy ją. Od projektów dla Uniwersytetu Gdańskiego po międzynarodowe konkursy, od szkoleń dla studentów po współpracę z firmami IT. Poznaj historię, projekty i ludzi, którzy od ponad dwóch dekad budują jedno z najaktywniejszych kół naukowych UG.",
  "content": {
    "about": "Koło Naukowe Systemów Informatycznych E-XPERT powstało na początku stycznia 2001 roku przy Wydziale Zarządzania Uniwersytetu Gdańskiego. Do życia powołała je grupa studentów pragnąca pod uczelnianą egidą poszerzać zainteresowania z zakresu zastosowań informatyki w biznesie. Od początku istnienia Koła jego misją było łączenie wiedzy z praktyką czyli utworzenie miejsca, w którym studenci mogli realizować własne projekty i uczyć się nowoczesnych technologii poprzez działanie.\n\nNajkrócej... \n\nKoło Naukowe Systemów Informatycznych e-xpert powstało na początku stycznia 2001 roku. Do życia powołała je grupa studentów Wydziału Zarządzania Uniwersytetu Gdańskiego pragnąca pod uczelnianą egidą poszerzać zainteresowania z zakresu zastosowań informatyki w biznesie. Obecnie w kole działa kilkanaście osób, z czego wszyscy aktywnie uczestniczą w spotkaniach oraz pracują nad bieżącymi projektami. \n\nJak zaczynaliśmy? \n\nNa początku istnienia organizacji staraliśmy się wyspecyfikować najciekawsze jej obszary. Pierwszymi przedsięwzięciami były analizy rynków usług informatycznych i telekomunikacyjnych. Dwa pierwsze projekty tego okresu dotyczyły: badania rynkowego w zakresie posiadanych systemów informatycznych w sektorze małych i średnich przedsiębiorstw oraz stworzenia systemu optymalizacji kosztowej taryf GSM dla firm posiadających kilkuset użytkowników. Równolegle powstawały pierwsze infrastrukturalne systemy informatyczne koła. Zbudowano wewnętrzny, internetowy system zarządzania projektami koła, który został zintegrowany z stroną www. \n\nW latach 2003–2008 Koło nabierało dojrzałości i coraz śmielej wychodziło poza mury uczelni. Członkowie E-XPERT zaczęli organizować cykl seminariów, które przybliżały nowoczesne technologie z zakresu informatyki, zarządzania oraz elektronicznej wymiany danych. Wśród zaproszonych gości znaleźli się przedstawiciele firm i instytucji, które inspirowały młodych entuzjastów IT – między innymi Microsoft Polska z prezentacją technologii .NET, firma Atena z warsztatami na temat praktycznego wykorzystania UML, a także Stowarzyszenie Project Management Polska, które prowadziło szkolenia poświęcone zarządzaniu projektami informatycznymi.\n\nTo był okres pierwszych naprawdę ambitnych przedsięwzięć. Po kilku miesiącach działalności zarząd Koła zdecydował się podjąć bardziej wymagające wyzwania, które na trwałe zapisały się w historii E-XPERT. Studenci rozpoczęli prace nad wielofunkcyjną platformą internetową eStudent, służącą integracji i obsłudze życia akademickiego, a także nad instalacją i budową oprogramowania terminali na Wydziale Zarządzania UG. Równolegle opracowano nowoczesną, jak na tamte czasy, stronę internetową Wydziału – jedną z pierwszych w pełni funkcjonalnych witryn uczelnianych w regionie.\n\nW tym samym okresie uruchomiono także pierwszą edycję programu IT-TEAM, który pozwalał studentom zdobywać doświadczenie zawodowe poprzez realizację projektów dla największych firm informatycznych i konsultingowych w Polsce. Była to inicjatywa pionierska – łącząca świat akademicki z praktyką biznesu w sposób, który wyprzedzał ówczesne standardy współpracy uczelni z rynkiem.\n\nPod koniec dekady E-XPERT wciąż rozwijał swoje kompetencje i rozszerzał działalność. Członkowie Koła organizowali szkolenia z języków programowania, administracji bazami danych i systemów informatycznych, a także uczestniczyli w konferencjach naukowych, z których relacje publikowano na stronie Koła. W 2007 roku narodziła się też inicjatywa stworzenia własnej biblioteczki – zbioru książek i czasopism branżowych, które miały służyć wszystkim członkom i wspierać ich rozwój. Książki kupowano sukcesywnie, często z prywatnych środków, budując tym samym wspólne zaplecze wiedzy i pasji.\n\nPo kilku latach intensywnej działalności E-XPERT nie przestał istnieć, lecz stopniowo spowolnił swoje tempo rozwoju. Strona internetowa Koła zniknęła, a jego aktywność przeniosła się do bardziej kameralnej formy – spotkań i projektów realizowanych przez mniejszą grupę członków. Pomimo ograniczonych zasobów, idea E-XPERT przetrwała dzięki zaangażowaniu studentów, którzy wciąż wierzyli w sens łączenia informatyki z biznesem. W 2012 roku Koło odzyskało pełną dynamikę, gdy studenci kierunku Informatyka i Ekonometria postanowili je odświeżyć i rozwinąć. Nowe pokolenie kontynuowało tradycję łączenia wiedzy akademickiej z praktyką – rozwijając projekty informatyczne, współpracując z firmami i tworząc społeczność, w której technologia jest sposobem nauki i współpracy.\n\nW 2015 roku Koło dołączyło do międzynarodowej organizacji Association for Information Systems Student Chapters (AIS SC), tworząc oddział AIS SC University of Gdansk. Od tego momentu działalność E-XPERT nabrała globalnego charakteru. Członkowie zaczęli uczestniczyć w konkursach i konferencjach o zasięgu światowym, zdobywając wyróżnienia za projekty łączące technologię z odpowiedzialnością społeczną. Jednym z nich był SafeWatch – aplikacja ratująca życie, umożliwiająca wezwanie pomocy za pomocą gestu smartwatcha. Projekt zdobył III miejsce w konkursie AIS Student Chapter Competition i został objęty ochroną patentową.\n\nW kolejnych latach E-XPERT rozwijał projekty, które odpowiadały na realne potrzeby społeczne i technologiczne. Powstały m.in. CyberWatch – system wykrywający cyberprzemoc, Unity – narzędzie do monitorowania opinii w Internecie, SNet – rozwiązanie wspierające bezpieczeństwo w sieci, czy Eris – Intelligent Baby Monitor System i Apollo – aplikacja pomagająca ograniczyć marnowanie żywności. Takie inicjatywy sprawiły, że E-XPERT stał się jednym z najbardziej rozpoznawalnych ośrodków studenckich innowacji w Polsce, regularnie pojawiającym się w finałach międzynarodowych konkursów AIS.\n\nKoło konsekwentnie rozwijało kulturę współpracy i dzielenia się wiedzą. Organizowane były otwarte warsztaty i szkolenia z zakresu JavaScript, Node.js, R, Excela, Agile czy Design Thinking, prowadzone przez członków E-XPERT oraz partnerów z branży IT. Spotkania i sesje projektowe odbywają się dziś w środowisku Microsoft Teams, które stało się cyfrowym centrum komunikacji Koła. To tam rodzą się nowe pomysły, powstają plany projektów i rozwijane są koncepcje, które później trafiają na areny międzynarodowe.\n\nWśród nowszych inicjatyw szczególnym uznaniem cieszył się projekt SocialMonitor – wtyczka do przeglądarki, która ukrywa liczbę reakcji w mediach społecznościowych, pomagając użytkownikom uwolnić się od presji popularności. Z kolei UniGo, inteligentna platforma wspierająca wybór kierunku studiów w ramach koncepcji Smart Cities, pokazała, że Koło potrafi łączyć naukę, sztuczną inteligencję i społeczne zaangażowanie. W projekcie wykorzystano algorytmy AI do analizy i standaryzacji danych edukacyjnych, co przyniosło Kołu kolejne wyróżnienie w międzynarodowym konkursie AIS.\n\nW ostatnich latach E-XPERT przeszedł również cyfrową transformację własnych struktur. Zespół całkowicie zmodernizował stronę internetową Koła, przenosząc ją z systemu CMS do modelu open source opartego o GitHub Pages. Był to symboliczny krok w kierunku otwartości, przejrzystości i samodzielności technologicznej – wartości, które dziś definiują działalność Koła. Modernizacja strony i repozytoriów GitHub, zrealizowana wspólnie przez zespoły 2023/24 i 2024/25, stała się wyrazem nowej tożsamości E-XPERT: nowoczesnej, spójnej i społecznościowej.\n\nObecnie Koło Naukowe Systemów Informatycznych E-XPERT skupia grupę aktywnych studentów, którzy nie tylko tworzą oprogramowanie, ale też prowadzą badania, występują na konferencjach i współpracują z partnerami biznesowymi. Współpraca z firmami, takimi jak MadKom, umożliwia członkom zdobycie praktycznego doświadczenia jeszcze w trakcie studiów, a udział w konkursach AIS i Imagine Cup otwiera drogę do międzynarodowych inicjatyw i karier.\n\nNad działalnością Koła czuwał prof. Stanisław Wrycza. W pierwszych latach działalności Koła szczególną rolę odegrał prof. Jerzy Auksztol, który był opiekunem E-XPERT'a i wspierał studentów w organizacji działań, tworzeniu pierwszych projektów oraz kształtowaniu struktury organizacyjnej Koła. Jego zaangażowanie pozwoliło zbudować fundamenty współpracy między Katedrą Informatyki Ekonomicznej a studentami, które do dziś stanowią istotę działalności E-XPERT. Następnie tę rolę przejął prof. Michał Kuciapski aż do 2021 roku. Obecnie opiekę sprawuje mgr Piotr Porzuczek, który wspiera studentów w rozwoju naukowym, merytorycznym i organizacyjnym.\n\nPo ponad dwóch dekadach działalności E-XPERT pozostaje jednym z najważniejszych kół naukowych Uniwersytetu Gdańskiego – organizacją, która łączy akademicką tradycję z duchem startupowej innowacyjności. To społeczność, która pokazuje, że technologia nie musi być tylko narzędziem – może być formą współpracy, ekspresji i wpływu na rzeczywistość.",
    "history": {
      "affiliation": "Koło działa przy Katedrze Informatyki Ekonomicznej Wydziału Zarządzania Uniwersytetu Gdańskiego.",
      "founding": "Koło Naukowe Systemów Informatycznych E-XPERT powstało na początku stycznia 2001 roku z inicjatywy grupy studentów Wydziału Zarządzania Uniwersytetu Gdańskiego, którzy 'pragnęli pod uczelnianą egidą poszerzać zainteresowania z zakresu zastosowań informatyki w biznesie'. Już w pierwszych miesiącach działalności zespół liczył kilkanaście aktywnych osób, realizujących projekty z pogranicza informatyki i zarządzania. Wczesne przedsięwzięcia obejmowały analizy rynku usług IT i telekomunikacyjnych oraz projekty takie jak system optymalizacji kosztów taryf GSM dla firm czy badanie wykorzystania systemów informatycznych w sektorze MŚP.",
      "development": "W pierwszych latach istnienia Koło zbudowało własny internetowy system zarządzania projektami, zintegrowany ze stroną WWW. Równocześnie rozpoczęto organizację seminariów przybliżających nowoczesne technologie informatyczne i zarządcze. Wśród zaproszonych prelegentów znaleźli się m.in. przedstawiciele Microsoft Polska, firmy Atena oraz Stowarzyszenia Project Management Polska. Po około pół roku działalności E-XPERT rozpoczął realizację bardziej zaawansowanych przedsięwzięć, takich jak budowa platformy eStudent, instalacja oprogramowania terminali na Wydziale Zarządzania UG czy projektowanie nowoczesnej strony internetowej wydziału. W tym czasie powstał również program IT-TEAM – inicjatywa organizacji praktyk studenckich w największych firmach informatycznych i konsultingowych w Polsce.",
      "mission_2003": "Jak podkreślano w 2003 roku, 'Koło skupia swoją działalność na rozwijaniu zainteresowań i umiejętności członków'. Członkowie E-XPERT uczestniczyli w konferencjach naukowych, organizowali szkolenia z języków programowania, administracji bazami danych oraz systemów informatycznych. W tym okresie rozpoczęto również budowę własnej biblioteczki tematycznej zawierającej książki i czasopisma branżowe.",
      "reactivation": "Po kilku latach intensywnej działalności Koło przestało funkcjonować, jednak w 2012 roku zostało reaktywowane przez studentów kierunku Informatyka i Ekonometria. Nowe pokolenie kontynuowało misję swoich poprzedników – łącząc pasję do technologii z praktycznymi projektami i współpracą z firmami IT.",
      "advisors": "W początkowym okresie działalności opiekę nad Kołem sprawował prof. Jerzy Auksztol, który wspierał studentów w tworzeniu pierwszych projektów i struktur organizacyjnych. Następnie funkcję opiekuna objął prof. Michał Kuciapski, pełniąc ją do 2021 roku. Od 2020 roku opiekunem Koła jest mgr Piotr Porzuczek, który wspiera członków E-XPERT w rozwoju naukowym i organizacyjnym."
    },
    "lead": "Koło Naukowe Systemów Informatycznych E-xpert działa na Uniwersytecie Gdańskim (Wydział Zarządzania). Głównym celem jest pogłębianie wiedzy z zakresu technologii informatycznych i metodyk zarządzania projektami IT oraz realizacja praktycznych projektów i szkoleń.",
    "activities": [
      "Udział w konkursach (Imagine Cup, AIS Student Chapter) — coroczny udział co najmniej w jednym konkursie.",
      "Realizacja projektów dla Uniwersytetu Gdańskiego.",
      "Szkolenia i warsztaty — zarówno z firmami zewnętrznymi, jak i 'od studentów dla studentów'.",
      "Testowanie rozwiązań z zakresu zarządzania i systemów informatycznych.",
      "Popularyzacja informatyki i przedsiębiorczości."
    ],
    "meetings": "Spotkania organizowane są w celu weryfikacji postępów prac projektowych i wymiany pomysłów (w praktyce komunikacja odbywa się m.in. na Discordzie).",
    "mission_goals": [
      "Zdobywanie i pogłębianie wiedzy z technologii informatycznych oraz metodyk zarządzania projektami IT.",
      "Realizacja projektów tworzących oprogramowanie i systemy informatyczne służące społeczeństwu.",
      "Rozwijanie praktycznych umiejętności wytwarzania technologii i zarządzania projektami poprzez szkolenia i warsztaty."
    ],
    "competitions_and_research": {
      "competitions": "Praca zespołowa nad innowacyjnymi koncepcjami i aplikacjami użytecznymi społecznie, udział w konkursach takich jak Imagine Cup oraz AIS Student Chapter.",
      "research": "Prace badawcze nad metodykami zarządzania projektami IT, implementacją nowych technologii oraz przygotowywanie publikacji naukowych."
    },
    "industry_collaboration": {
      "description": "Koło współpracowało z wieloma firmami z branży IT oraz Uniwersytetem Gdańskim, dzięki czemu nasi członkowie zdobywali praktyczne doświadczenie poprzez staże, projekty i warsztaty.",
      "partners": [
        {
          "name": "Uniwersytet Gdański",
          "url": "https://ug.edu.pl"
        },
        {
          "name": "Madkom",
          "url": "https://madkom.pl"
        },
        {
          "name": "Neoteric",
          "url": "https://neoteric.eu"
        },
        {
          "name": "Bright Inventions",
          "url": "https://brightinventions.pl"
        },
        {
          "name": "Staples Solutions"
        }
      ]
    },
    "plans": [
      "Uczestnictwo w corocznym konkursie AIS.",
      "Pozyskanie firm oferujących warsztaty i praktyki dla członków."
    ]
  }
}
