{
  "title": "Projekty AIS SC",
  "intro": "Koło Naukowe Systemów Informatycznych E-XPERT od 2015 roku przynależy do międzynarodowej organizacji Association for Information Systems Student Chapters (AIS SC), tworząc oddział AIS SC University of Gdansk. Członkowie koła tworzyli rozwiązania społeczne, takie jak SafeWatch, CyberWatch, Unity, Your Guard i mobileWZR.",
  "projects": [
    {
      "name": "Modernizacja Strony Internetowej Koła",
      "description": "Kompleksowa modernizacja obecności cyfrowej koła E-XPERT — migracja z WordPress na GitHub Pages z nowoczesnym, minimalistycznym designem. Porzucenie przestarzałego WordPressa na rzecz nowoczesnego, statycznego rozwiązania opartego o GitHub Pages. Nowa strona wykorzystuje dynamiczne ładowanie treści z plików JSON, hash routing dla bezpośredniego linkowania sekcji oraz zoptymalizowany układ responsywny. Projekt obejmował przeprojektowanie architektury informacji, implementację nowego systemu kolorystycznego (#1c1b22/#f3f3f7) oraz integrację logo SVG z przemyślaną typografią. Wspólny wysiłek zespołów z lat 2023/24 i 2024/25.",
      "team": [
        "Wspólny wysiłek zespołu 2024/25"
      ],
      "year": 2025,
      "achievements": [
        "Porzucenie WordPress na rzecz GitHub Pages",
        "Migracja z CMS na statyczną stronę z JSON",
        "Dynamiczny system zarządzania treścią (JSON)",
        "Implementacja hash routing dla lepszej nawigacji",
        "Zero kosztów hostingu dzięki GitHub Pages"
      ],
      "technologies": [
        "HTML5/CSS3",
        "Vanilla JavaScript",
        "GitHub Pages",
        "GitHub Actions",
        "JSON Data Structure",
        "Hash-based Routing"
      ],
      "images": [
        "https://i.imgur.com/RWEbA15.png"
      ]
    },
    {
      "name": "Modernizacja konta Github",
      "description": "Kompleksowa modernizacja obecności cyfrowej koła E-XPERT — migracja z WordPress na GitHub Pages z nowoczesnym, minimalistycznym designem. Porzucenie przestarzałego WordPressa na rzecz nowoczesnego, statycznego rozwiązania opartego o GitHub Pages. Nowa strona wykorzystuje dynamiczne ładowanie treści z plików JSON, hash routing dla bezpośredniego linkowania sekcji oraz zoptymalizowany układ responsywny. Projekt obejmował przeprojektowanie architektury informacji, implementację nowego systemu kolorystycznego (#1c1b22/#f3f3f7) oraz integrację logo SVG z przemyślaną typografią. Wspólny wysiłek zespołów z lat 2023/24 i 2024/25.",
      "team": [
        "Wspólny wysiłek zespołu 2023/24"
      ],
      "year": 2024,
      "achievements": [
        "Uporządkowanie i reorganizacja repozytoriów koła na GitHub",
        "Usunięcie nieaktualnych i nieużywanych repozytoriów",
        "Standaryzacja nazewnictwa projektów",
        "Aktualizacja dokumentacji README dla kluczowych repozytoriów",
        "Archiwizacja starszych projektów zgodnie z dobrymi praktykami",
        "Wprowadzenie spójnej struktury organizacyjnej konta GitHub"
      ],
      "technologies": [
        "HTML5/CSS3",
        "Vanilla JavaScript",
        "GitHub Pages",
        "GitHub Actions",
        "JSON Data Structure",
        "Hash-based Routing"
      ],
      "images": [
        "https://i.imgur.com/9CyVS5r.png"
      ]
    },
    {
      "name": "UniGo - Smart Cities Communication Platform",
      "description": "Platforma komunikacji i współpracy dla Smart Cities, stworzona w odpowiedzi na wyzwania, przed którymi stoją studenci przy wyborze kierunku studiów. UniGo standaryzuje informacje o uczelniach, programach rządowych, stypendiach i oferuje dostęp do danych w czasie rzeczywistym. System wykorzystuje sztuczną inteligencję (OpenAI) do normalizacji danych i dopasowywania kierunków do zainteresowań studentów. Projekt łączy standaryzację danych o uczelniach, algorytm dopasowywania kierunków do zainteresowań użytkownika oraz przyjazny interfejs użytkownika. Badania własne zespołu (50 respondentów) wykazały, że 80% potencjalnych użytkowników chce korzystać z takiego narzędzia, a 60% uważa proces wyszukiwania studiów za skomplikowany. Rozwiązanie adresuje problemy istniejących platform rządowych (ELA, studia.gov.pl), które cierpią na brak standaryzacji, przestarzałe dane i słabą jakość interfejsu.",
      "team": [
        "Cornelis Puchowicz (autor koncepcji)",
        "Łukasz Pisarczyk",
        "Piotr Jemielita"
      ],
      "year": 2023,
      "achievements": [
        "Nominacja do finałów AIS Student Chapter Competition 2023",
        "Kompleksowa analiza problemu wyboru kierunku studiów w Polsce",
        "Badania własne z 50 respondentami (studenci i licealiści)",
        "Propozycja standaryzacji danych o kierunkach studiów",
        "Wykorzystanie AI (OpenAI) do normalizacji danych edukacyjnych",
        "Algorytm dopasowywania kierunków do zainteresowań użytkowników"
      ],
      "technologies": [
        "OpenAI API",
        "Web Application",
        "Data Standardization",
        "Smart Cities Integration",
        "Algorithm Design",
        "User Research & Surveys"
      ],
      "images": [
        "https://i.imgur.com/wmyUNGB.png",
        "https://i.imgur.com/9KpbNhg.png"        
      ]
    },
    {
      "name": "SocialMonitor",
      "description": "Wtyczka SocialMonitor służy do ukrywania reakcji pod materiałami w mediach społecznościowych. Jej celem jest zniwelowanie skutków ubocznych korzystania z social mediów (presja społeczna, depresja, zaburzenia odżywiania). Dzięki temu użytkownicy mogą wyrażać opinie bez wpływu liczby polubień, a serduszka czy lajki są ukryte.",
      "team": ["Justyna Krotoszyńska", "Kajetan Warmbier", "Kacper Jach"],
      "year": 2022,
      "images": [
        "https://i.imgur.com/LTmBfuX.png"
      ]
    },
    {
      "name": "CyberWatch",
      "description": "System rozpoznawania aktów cyberprzemocy, takich jak hejt, stalking czy rozpowszechnianie fałszywych informacji. Rozszerzenie przeglądarkowe analizujące treści z użyciem IBM Watson i technologii REST. Projekt zdobył III miejsce w konkursie IBM Bright ICT (Indiana University, 2016) oraz wyróżnienie za efektywne wykorzystanie IBM Bluemix Cloud.",
      "team": [
        "Kamil Wojewski (lider)",
        "Damian Kisielewski",
        "Maciej Kwapiński",
        "Szymon Nagórski",
        "Hubert Kisielewski"
      ],
      "year": 2016,
      "images": [
        "https://i.imgur.com/g3PJzSY.png"
      ]
    },
    {
      "name": "Unity",
      "description": "Aplikacja webowa autorstwa Piotra Małeckiego umożliwiająca monitorowanie opinii na temat osób i organizacji w Internecie. Analizuje stosunek opinii pozytywnych i negatywnych oraz trendy w czasie. Zintegrowana z IBM Bluemix i Alchemy API, zdobyła wyróżnienie za najbardziej innowacyjne zastosowanie chmury IBM w konkursie IBM Bright ICT.",
      "team": ["Piotr Małecki"],
      "year": 2016,
      "images": []
    },
    {
      "name": "SafeWatch",
      "description": "Innowacyjna aplikacja mobilna umożliwiająca wezwanie pomocy w sytuacji zagrożenia za pomocą gestów (np. trzykrotne stuknięcie w smartwatch). Dane o miejscu i czasie zdarzenia trafiają na serwer i mogą być udostępniane służbom. Projekt zdobył III miejsce w konkursie AIS Student Chapter Competition 2015 na University of Alabama.",
      "team": [
        "Kamil Wojewski (lider)",
        "Damian Kisielewski",
        "Maciej Kwapiński",
        "Szymon Nagórski",
        "Hubert Kisielewski"
      ],
      "year": 2015,
      "achievements": [
        "III miejsce w AIS Student Chapter 2015",
        "Patent Pending w Urzędzie Patentowym RP",
        "Prezentacje w TVN24, TVP, RMF FM, Radio Zet, Gazeta Wyborcza, Puls Biznesu"
      ],
      "images": [
        "https://i.imgur.com/sinO2M0.png",
        "https://i.imgur.com/kv000A8.png",
        "https://i.imgur.com/y0VcWnS.png"
      ]
    },
    {
      "name": "Your Guard",
      "description": "System cyfrowej mapy przestępczości, pozwalający śledzić miejsca zagrożeń. Informuje o częstych rozbojach i przestępstwach, wskazując luki w patrolach i działaniach policji. Projekt zakwalifikowany do finału AIS Student Chapter Competition 2015 w kategorii IS That Serves Society.",
      "team": ["Michał Karpiński", "Tomasz Krakówka", "Piotr Sankowski"],
      "year": 2015,
      "images": []
    },
    {
      "name": "mobileWZR",
      "description": "Aplikacja mobilna dla studentów Wydziału Zarządzania UG, umożliwiająca przeglądanie planu zajęć, dodawanie notatek, synchronizację i powiadomienia o zbliżających się zajęciach. Pierwsza wersja powstała w 2014 roku i jest stale rozwijana.",
      "year": 2014,
      "images": [
        "https://i.imgur.com/nk7ylQ1.png"
      ]
    }
  ]
}
